{"pageProps":{"content":{"id":"cfms","contentHtml":"<h2>Overview</h2>\n<p>After a lot of hard work, we have finally completed the first version of our custom FMS. We'd like to extend credit to the Working Title team as their code was the basis for cFMS version 1.</p>\n<p>This update brings significantly more stable flight plan editing capabilities, support for RF and VM legs, entirely custom LNAV path prediction and guidance loops, as well as a completely re-worked, 100% from scratch ND using extremely accurate data and references, going as far as replicating real-life symbol data limits and error messages.</p>\n<p>This exciting update is only the beginning of what is to come. We are already doing heavy development of the second version of this system, which includes support for very long awaited features. More previews on this will come soon.</p>\n<p><strong>Please note:</strong> users currently on Stable or Development releases might notice some changes that affect how they interact with the FMS. We have prepared a documentation page for easing the transition, as well as a known issues page for this new system.</p>\n<ul>\n<li><a href=\"https://docs.flybywiresim.com/fbw-a32nx/feature-guides/cFMS/\">Custom Flight Management System</a></li>\n<li><a href=\"https://docs.flybywiresim.com/fbw-a32nx/feature-guides/cFMS/#known-issues\">Known Issues</a></li>\n</ul>\n<p>This effectively brings over the Experimental branch to the Development version, which means we recommend users to switch to the Development version as bug fixes and improvements towards this functionality will only happen there.</p>\n<p>A huge thank you to the developers below for all the work put into this.</p>\n<ul>\n<li>2hwk</li>\n<li>AGuther</li>\n<li>Aaryan</li>\n<li>BehEh</li>\n<li>DerL30N</li>\n<li>Grinde</li>\n<li>Holland</li>\n<li>Iceman</li>\n<li>Saschl</li>\n<li>lukecologne</li>\n<li>pareil6</li>\n<li>tracernz</li>\n<li>tyler58546</li>\n</ul>\n<h3>WX/TER/TCAS</h3>\n<p>It is important to note that the weather and terrain radars, as well as TCAS, are not available yet with cFMS v1. Our current focus is to deliver a more realistic flight planning and navigation experience while maintaining performance and reliability. However, we are not satisfied with how the default code performs together with our custom systems.</p>\n<p>We believe the benefits that cFMS provides outweigh the temporary lack of WX/TERR/TCAS functionality on the development version. We are already hard at work developing our TCAS system and we will provide more details on it as soon as we can. Weather and terrain still prove to be a challenge due to the lack of a native SDK API. We have posted about it on the MSFS forums, where it currently sits at the top of the wishlist and Asobo are investigating how to best improve their API.</p>\n<p><a href=\"https://forums.flightsimulator.com/t/implement-weather-and-terrain-api-s-for-aircraft-developers-to-implement-accurate-radar-predictive-windshear-egpws-and-metar-wind-uplink/442016\">Read more about weather and terrain API</a>.</p>\n<h3>Additional Information</h3>\n<p>The experimental branch is on hold until the next major feature is ready for testing. We ask our users to switch to the development version to continue receiving the latest updates and fixes.</p>\n<p>Our latest Stable Version 0.7.3 will be the last stable release with the default FMS from Asobo. If you require the default FMS for third-party compatibility please continue to use Stable v0.7.3.</p>\n<hr>\n<h2>General Information</h2>\n<p>Stay up to date with information from FlyByWire Simulations by following our social media!</p>\n<ul>\n<li><a href=\"https://twitter.com/FlyByWireSim\">Twitter</a></li>\n<li><a href=\"https://www.facebook.com/FlyByWireSimulations/\">Facebook</a></li>\n</ul>\n<p>If you require support or would like to submit a bug report please see the links below:</p>\n<ul>\n<li><a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/\">Support Guide</a></li>\n<li><a href=\"https://discord.gg/flybywire\">Discord Support</a></li>\n<li><a href=\"https://github.com/flybywiresim/a32nx/issues/new/choose\">GitHub Issues</a></li>\n</ul>\n<p>When submitting an issue or asking for support to do the following:</p>\n<ul>\n<li>Visit our <a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/reported-issues/\">Reported Issues Documentation</a> for common problems and workarounds.</li>\n<li>Ensure that your issue has not already been reported on our GitHub.</li>\n</ul>\n<p>Download the latest version of the A32NX:</p>\n<ul>\n<li><a href=\"https://api.flybywiresim.com/installer\">Installer</a></li>\n<li><a href=\"https://flybywiresim.com/a32nx/#download\">Standalone Versions</a></li>\n</ul>\n<hr>\n<p>Safe skies and happy flying!</p>\n","readingStats":{"text":"4 min read","minutes":3.015,"time":180900,"words":603},"title":"Custom Flight Management System","date":"2021-11-23","authors":["Holland","Valastiri","Kevin"],"category":"UPDATE","metaImage":"/img/rear_a32nx.jpg","metaAlt":"FlyByWire Simulations"},"embedPreviewPath":"img/notams-embed-previews/f670df66-722b-4339-b06f-827930c125a2.png"},"__N_SSG":true}