{"pageProps":{"content":{"id":"development_notam-2021-07-13","contentHtml":"<h2>Overview</h2>\n<p>It has been an amazing journey over these past ten months here at FlyByWire Simulations. We have some exciting things that are on our development branch! In this NOTAM we are going to give you an overview of changes that have been implemented:</p>\n<ul>\n<li>flyPadOS v2! Brand new UI and features available.</li>\n<li>Sound implementation + upcoming planned audio effects.</li>\n<li>Hydraulics implementation and state.</li>\n<li>Progress of custom FMGC/LNAV/ND.</li>\n</ul>\n<hr>\n<h2>Development Updates</h2>\n<h3>flyPadOS v2</h3>\n<p>The latest update of our flyPad has received:</p>\n<ul>\n<li>Landing performance calculator.</li>\n<li>New user interface design.</li>\n<li>More options in the settings page.</li>\n<li>Navigraph charts integration.</li>\n</ul>\n<p>You heard it right! We’re excited to deliver Navigraph charts functionality in the EFB. Getting started is simple - all you need to do is to:</p>\n<ol>\n<li>Select the Charts tab on the EFB.</li>\n<li>Scan the QR code to authenticate.</li>\n</ol>\n<p>NOTE: The use of Navigraph charts requires an active Ultimate subscription with Navigraph. You can check the current price at <a href=\"https://navigraph.com/products/subscriptions\">Navigraph Subscriptions</a>.</p>\n<p>We are also planning to add Chartfox integration to the EFB at a later date.</p>\n<p>As briefly touched on before, we have done a major redesign to the look and feel of the entire EFB for a more refined appearance and improved usability.</p>\n<p>While exploring the EFB you may have noticed that the settings page is now no longer greyed out. We have moved all the settings from the MCDU into the EFB. On a final note, the default keybinds no longer trigger when using an input while using the EFB natively, meaning you no longer have to “pop-out” the EFB window to type.</p>\n<p><em>Development Credits: Antiso, Blurpyx, Holland, Falcon, Saschl, TheMightyMat, and ZeroKaa.</em></p>\n<p><img src=\"/img/notam-images/efb1.png\" alt=\"EFB 1\">\n<img src=\"/img/notam-images/efb2.png\" alt=\"EFB 2\">\n<img src=\"/img/notam-images/efb3.png\" alt=\"EFB 3\"></p>\n<h3>Latest Sound Implementation and Plans</h3>\n<p>We recently merged major improvements to our sounds module in the A32NX.</p>\n<p>Available now:</p>\n<ul>\n<li>New avionics fans audio for a more immersive power up and shutdown.</li>\n<li>Added yellow and blue electric pumps sounds (audible in the cabin mostly)</li>\n<li>Added sounds for wipers.</li>\n<li>Added sound of the ground service bus (everytime you load in you will hear a clunk and a small whine).</li>\n<li>Added custom FCU sound effects.</li>\n<li>Enhanced engine spool up.</li>\n<li>Reworked engine sounds from idle to TOGA (heard externally and internally).</li>\n<li>Reworked engine startup completely (interior and exterior).</li>\n<li>Reworked fuel pumps on the outside and inside.</li>\n</ul>\n<p>Not only have we pushed noticeable changes that you can hear, but we’ve added in events that allow developers to implement the logic at a later time.</p>\n<p>Events added without logic:</p>\n<ul>\n<li>TCAS wwise events.</li>\n<li>ROPS wwise events.</li>\n</ul>\n<h3>Hydraulic Implementation</h3>\n<p>We have completed major steps recently towards a more accurate hydraulics system in the A32NX. Some of these features include:</p>\n<ul>\n<li>Brakes available when engines are off.</li>\n<li>Hydraulics connected to electrical system.</li>\n<li>Replaced default brakes with custom hydraulic brakes.</li>\n<li>Custom autobrake to match conditions and dynamic deceleration targets of the real A320neo.</li>\n</ul>\n<p>For a great summary of everything available in our development version check out 320 Sim Pilot's A32NX hydraulics video below:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/7uV27k8FsNQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>There are so many aspects of the hydraulic system to implement that we can’t cover them all here, but some of the next steps are:</p>\n<ul>\n<li>Tuning brake forces to match real plane performance figures.</li>\n<li>Modelling the blue hydraulic/electric emergency generator.</li>\n<li>Modelling the RAT accurately.</li>\n<li>Creating a physical model of the PTU.</li>\n<li>Connecting and modelling all actuators one by one.</li>\n</ul>\n<h3>Custom FMGC/LNAV/ND</h3>\n<p>The custom FMGC and navigation display are being developed in the <code>autopilot-custom-fpm</code> branch of the A32NX repository. This build is not yet available for general use (although you can compile it yourself, to check it out; but keep in mind that no support/assistance will be provided). As a reminder, this change includes the following:</p>\n<ul>\n<li>Initial custom FMGC and LNAV implementation.</li>\n<li>Better handling of flight plan modifications, SIDs, STARs, DIRECT TO.</li>\n<li>Custom navigation display (ND).</li>\n</ul>\n<p>The current focus is on finishing up the custom navigation display, which brings more accurate graphics and less performance impact on the simulator framerate.</p>\n<hr>\n<h2>General Information</h2>\n<p>Stay up to date with information from FlyByWire Simulations by following our social media!</p>\n<ul>\n<li><a href=\"https://twitter.com/FlyByWireSim\">Twitter</a></li>\n<li><a href=\"https://www.facebook.com/FlyByWireSimulations/\">Facebook</a></li>\n</ul>\n<p>If you require support or would like to submit a bug report please see the links below:</p>\n<ul>\n<li><a href=\"https://discord.gg/flybywire\">Discord Support</a></li>\n<li><a href=\"https://github.com/flybywiresim/a32nx/issues/new/choose\">GitHub Issues</a></li>\n</ul>\n<p>When submitting an issue or asking for support to do the following:</p>\n<ul>\n<li>Visit our <a href=\"https://docs.flybywiresim.com/start/reported-issues/\">Reported Issues Documentation</a> for common problems and workarounds.</li>\n<li>Ensure that your issue has not already been reported on our GitHub.</li>\n</ul>\n<p>Download the latest version of the A32NX:</p>\n<ul>\n<li><a href=\"https://api.flybywiresim.com/installer\">Installer</a></li>\n<li><a href=\"https://flybywiresim.com/a32nx/#download\">Standalone Versions</a></li>\n</ul>\n<hr>\n<p>Safe skies and happy flying!</p>\n","readingStats":{"text":"5 min read","minutes":4.15,"time":249000,"words":830},"title":"Development Updates July 2021","date":"2021-07-13","authors":["Valastiri","Falcon","Davy","Boris","Kevin","Holland"],"category":"UPDATE","metaImage":"/img/notam-images/efb-featured.png","metaAlt":"FlyByWire Simulations"},"embedPreviewPath":"img/notams-embed-previews/4e4e75a4-d96e-4cfe-b2a5-513e37fea074.png"},"__N_SSG":true}