{"pageProps":{"content":{"id":"flypados3","contentHtml":"<h2>Overview</h2>\n<p>After lots of exploration, testing, and development, we are very happy to announce the release of our most feature rich update yet to our onboard Electronic Flight Bag (EFB) - flyPadOS 3. We have transformed the user interface in an effort to provide a more user-friendly, efficient, and consistent experience when using the flyPad. Along with the strides made in this new iteration of the flyPad, we are proud to say that with the help of over 200 contributors, we are the first to develop an EFB that offers support for multiple languages - enabling flight simmers from across the globe to have a more comfortable and familiar experience when flying.</p>\n<p><strong>Update (2022-06-03):</strong> We have issued a small correction to the naming convention for the EFB feature - Aircraft Presets (previously titled <em>AI Co-Pilot</em>). We have updated the\nsection below to better reflect the feature's purpose.</p>\n<h2>New Features</h2>\n<h3>A Refreshed User Experience</h3>\n<p>The flyPadOS has been overhauled with new improvements thanks to feedback from the team and community. The following important information is on the new dashboard:</p>\n<ul>\n<li>Shortcuts to take you to where you want to go.</li>\n<li>Flight status and general information including your planned route.</li>\n<li>METAR information - customizable with your choice of ICAO (displayed raw or with simple symbology).</li>\n<li>Active and upcoming checklists.</li>\n<li>Pinned Navigraph charts.</li>\n<li>Active failure management.</li>\n</ul>\n<p>This new focus on user experience is present throughout our flyPadOS, enabling our pilots to quickly peruse their OFP, access calculations/charts, seamlessly download simBrief OFP, and integrate easily with online networks such as VATSIM or IVAO.</p>\n<p>As you navigate throughout the EFB accessing different features and interacting with them, flyPadOS 3 now remembers the state you left it in. It remembers the pages or tabs with the associated data you have entered, so you can safely switch to a new screen without losing any data.</p>\n<p><img src=\"/img/notam-images/flypados3/pinned-charts-widget.png\" alt=\"Dashboard\">\n<img src=\"/img/notam-images/flypados3/weather-widget-input.png\" alt=\"Weather Widget\">\n<img src=\"/img/notam-images/flypados3/flypad-dispatch-fuel.png\" alt=\"Fuel Dispatch\">\n<img src=\"/img/notam-images/flypados3/flypad-dispatch-ofp.png\" alt=\"OFP Dispatch\"></p>\n<h3>Support for Over 30 Different Languages</h3>\n<p>We are extremely happy to offer support for over 30 languages onboard our EFB. A first in flight simulation, you can now access all the features mentioned above and interact with them in a language of your choice! This would not have been possible without the help of over 200 contributors, and those who have offered to review every corner of the EFB for accuracy. A huge benefit of an open source project is our unique position to have our community assist in endeavors such as this. We cannot stress enough how thankful we are.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-languages.png\" alt=\"Languages\"></p>\n<h3>Integrated Pushback</h3>\n<p>Our new pushback model is smoother with finer control for speed and direction. You can easily utilise your controller axes to steer the tug as you pushback.\nWe have made it easier to see your turn radius and projected path with the new onboard map. This gives our pilots accurate and precise turns during pushback without having to switch to an external view.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-pushback.png\" alt=\"Pushback\"></p>\n<h3>Performance Calculation</h3>\n<p>While we continue to work on providing accurate NEO performance calculations for takeoff, the rest of this module is tuned for precision with our flight model and braking simulation. Top of descent calculation, in tandem with various onboard A32NX systems, ensures you will always stay ahead of the aircraft and keep up with ATC instructions.</p>\n<p>Our landing calculation page effortlessly pulls in information from your simBrief OFP to populate required fields. If you didn't generate an OFP you can simply choose the relevant ICAO for your landing. Our documentation provides all the information you need to accurately plan your stopping distances.</p>\n<p><a href=\"https://docs.flybywiresim.com/fbw-a32nx/feature-guides/flypados3/performance/#ground-speed-and-wind\">Landing Performance Calculator Documentation</a>.</p>\n<p><img src=\"/img/notam-images/flypados3/performance-landing-ok.png\" alt=\"Landing OK\">\n<img src=\"/img/notam-images/flypados3/performance-landing-maxok.png\" alt=\"Landing MAX\">\n<img src=\"/img/notam-images/flypados3/performance-tod-distance.png\" alt=\"TOD Distance\"></p>\n<h3>Interactive \"Smart\" Checklists</h3>\n<p>We have included essential interactive checklists, accessible through its own tab on the left menu. The dashboard on the EFB also intelligently recommends the correct checklist based on the current phase of flight you are in.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-checklist-page-partly-filled.png\" alt=\"Checklist 1\">\n<img src=\"/img/notam-images/flypados3/flypad-checklist-page-section-filled.png\" alt=\"Checklist 2\"></p>\n<p>The checklists page will also display what checklist you currently have active, and what checklists you are yet to complete. You can use your mouse to click on each line item, or simply use the \"Mark item as complete\" button at the bottom of the page. If you would like to utilise your hardware, we have some easy to use LVARs for those of you who can write to those.</p>\n<h3>Onboard Navigraph Charts</h3>\n<p>Every flight requires meticulous planning. Keep your procedures close at hand, with our easily accessible Navigraph charts integration. This way there is no fumbling around with the MSFS toolbar and overlays, which may ruin your immersion.</p>\n<p>Our new integration now supports the aircraft position symbol for better visualization of where your aircraft is on a particular chart. Our unified experience means that any chart you are viewing will remain active - even if you navigate away from the charts page. We have also included support for pinning relevant procedure maps, which are conveniently displayed on the flyPad's dashboard.</p>\n<p>Something we also hope you can look forward to is our planned Local Files support. This will allow users load any image or PDF onboard EFB for effortless viewing.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-navigation.png\" alt=\"Navigraph Charts\">\n<img src=\"/img/notam-images/flypados3/pinned-charts.png\" alt=\"Pinned 1\"></p>\n<h3>Failure Simulation</h3>\n<p>We have improved the UI for our failure simulations, now grouping them under their respective ATA chapters. You can choose between two different views depending on how you want information to be displayed. While we continuously work on improving our failure simulations, this new method of displaying failures will mean a better, and easier, experience going forward.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-failures.png\" alt=\"Failures Comfort\">\n<img src=\"/img/notam-images/flypados3/flypad-failures-compact-view.png\" alt=\"Failures Compact\"></p>\n<h3>Online ATC</h3>\n<p>\"Alt-tabbing\"  to check the online ATC is not always the best when you're in command! The new online ATC page gives you a simplified overview of what frequencies are online and in range during your flight. Here you can also easily switch between active or standby frequencies.</p>\n<p>We've also provided a text based output for ATIS, enabling our pilots to always have a quick reference to current ATIS information for departures and arrivals.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-online-atc-vatsim.png\" alt=\"Online ATC\"></p>\n<h3>Presets</h3>\n<h3>Customizable Lighting Presets</h3>\n<p>Do you have that perfect cockpit lighting setup that you spend a few minutes on each flight getting just right? Well now you can save it! We know that starting a flight in a cold and dark state means you have a lot to do before you can get off the ground, so we hope this provides a nice little quality of life feature for our pilots.</p>\n<p>Our new presets page allows you to save up to 8 custom presets, name them, and load them up instantaneously at any point during your flight.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-presets-lighting.png\" alt=\"Lighting Preset\"></p>\n<h4>Aircraft Presets</h4>\n<p>We heard you liked having an AI co-pilot. This new feature simulates a co-pilot providing assistance with \"on-the-ground\" actions up to your takeoff roll.</p>\n<p>The different aircraft states are accessible via the aircraft presets page and will sequentially perform the necessary setup tasks as in real life - from\nADIRs alignment to engine starts. Do note that even this feature is realistically simulated, so the co-pilot will take the appropriate amount of time and steps to complete the\nprocedures and actions. We would like to remind our pilots flying that it is still your responsibility to ensure the MCDU, FCU, transponder and radios are appropriately configured.</p>\n<p><img src=\"/img/notam-images/flypados3/flypad-presets-aircraft.png\" alt=\"Aircraft States\"></p>\n<h2>Upcoming Features</h2>\n<p>At FlyByWire Simulations we are constantly coming up with new ideas and improvements. This means our pilots still have plenty of features to look forward to with future updates to flyPadOS 3 that we are working hard to deliver. Below is a short list of items we hope you will be excited for:</p>\n<ul>\n<li>FlyByWire SimBridge Integration for Local Files\n<ul>\n<li>Loading custom PDFs straight into the flyPad</li>\n</ul>\n</li>\n<li>Right to Left Writing</li>\n<li>Pushback Planning</li>\n<li>Improvements to Brightness Control</li>\n<li>Throttle Calibration Wizard</li>\n<li>W&#x26;B Loading Page</li>\n<li>Drawing on Charts</li>\n</ul>\n<hr>\n<h2>General Information</h2>\n<p>Stay up to date with information from FlyByWire Simulations by following our social media!</p>\n<ul>\n<li><a href=\"https://twitter.com/FlyByWireSim\">Twitter</a></li>\n<li><a href=\"https://www.facebook.com/FlyByWireSimulations/\">Facebook</a></li>\n</ul>\n<p>If you require support or would like to submit a bug report please see the links below:</p>\n<ul>\n<li><a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/\">Support Guide</a></li>\n<li><a href=\"https://discord.gg/flybywire\">Discord Support</a></li>\n<li><a href=\"https://github.com/flybywiresim/a32nx/issues/new/choose\">GitHub Issues</a></li>\n</ul>\n<p>When submitting an issue or asking for support to do the following:</p>\n<ul>\n<li>Visit our <a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/reported-issues/\">Reported Issues Documentation</a> for common problems and workarounds.</li>\n<li>Ensure that your issue has not already been reported on our GitHub.</li>\n</ul>\n<p>Download the latest version of the A32NX:</p>\n<ul>\n<li><a href=\"https://api.flybywiresim.com/installer\">Installer</a></li>\n<li><a href=\"https://flybywiresim.com/a32nx/#download\">Standalone Versions</a></li>\n</ul>\n<hr>\n<p>Safe skies and happy flying!</p>\n<p>Editors: <em>ErickSharp, 2cas</em></p>\n","readingStats":{"text":"8 min read","minutes":7.205,"time":432300,"words":1441},"title":"The New flyPadOS 3 - A Best in Class EFB Experience","date":"2022-05-28","authors":["Cdr_Maverick","DirtyFormal","Valastiri"],"category":"UPDATE","metaImage":"/img/notam-images/flypados3/flypad-hero.png","metaAlt":"FlyByWire Simulations"},"embedPreviewPath":"img/notams-embed-previews/a7378670-e5e0-4a78-a97e-53d2fcb6bc8f.png"},"__N_SSG":true}