{"pageProps":{"content":{"id":"vdl3","contentHtml":"<h2>What's New About the Datalink?</h2>\n<p>Over the past few months, we have been hard at work implementing the Air Traffic Service Unit (ATSU), which is responsible for aircraft communications.\nATC and AOC communications are managed within the ATSU, where it then prioritises voice and datalink transmissions.</p>\n<p>The ATSU manages different kinds of data and voice communications, like Very-High Frequency (VHF),\nHigh Frequency (HF) and SATellite COMmunication (SATCOM).</p>\n<h2>Future Air Navigation System - FANS</h2>\n<p>Airbus have introduced different systems for the communication between flight crew and air traffic control (ATC).\nThe global standard is called the Future Air Navigation System, and the specific Airbus implementations are named FANS-A/A+,\nFANS-B/B+ and FANS-C. The '+' variants are extensions of the corresponding standards.</p>\n<p>Most of the world uses FANS-A, while Europe uses FANS-B.\n<a href=\"https://safetyfirst.airbus.com/app/themes/mh_newsdesk/documents/archives/the-future-air-navigation-system-fans-b.pdf\">This Airbus safety report</a> gives a good overview of which\nareas in the world use which system.</p>\n<p>Some aircraft only support FANS-A/A+ or FANS-B/B+ - Atlantic crossings require FANS-A/A+, for example.\nTherefore, Airbus developed a system that allows communication through all three types of FANS standards, with the aircraft selecting the correct system based on the connection to the ground station.</p>\n<p>We decided to follow this implementation and simulate FANS-A+ and FANS-B+ in the A32NX with automatic mode selection.\nThe mode selection is implemented via the ATC station which accepted the aircraft's logon request, with the FANS-A+ and FANS-B+ being comparable to real world coverage.</p>\n<h2>Very-High Frequency Digital Link Mode 3 - VDL3</h2>\n<p>VHF communication can be simulated through a simple Line-of-Sight (LoS) simulation between air and ground-stations.\nLine of Sight means exactly that - if the path is unimpeded by terrain, communication between the two stations is possible.</p>\n<p><a href=\"/img/notam-images/may2022/LoS.png\"><img src=\"/img/notam-images/may2022/LoS.png\" alt=\"Line-of-sight calculation\"></a></p>\n<p>Our simulation assumes that all international airports can provide datalink communication via SITA or ARINC, which are\nthe most popular system providers for data exchange between ground and air-stations.</p>\n<p>Based on the current status of the A32NX, we have chosen to simulate all international airports being capable of the maximum datarate.\nThe datarate is mainly based on distance and the theoretical maximum datarate of 31.5 kilobits per second.</p>\n<p>The VDL standard provides several sub-standards, and we decided to implement VDL3. While it is never used in the real world, it is comparable to currently used standards, and allows an easier and faster simulation over the other standards.</p>\n<p>The VDL defines different chunks for the different transmission times per second.\nWe follow the 1V3D pattern per 120 milliseconds. It means that the first chunk is used for voice communication and the following\nthree are used for datapacket transmissions. These chunks are equally assigned to all active communication partners.</p>\n<p>The following image illustrates the TDMA slot system with the different nodes.\nThe yellow slots describe voice slots that are exclusivly used to transmit voice messages and\ngreen slots describe the slots that are used to exchange Up- and Downlink messages.\nThe red slot is defined as a management slot that defines if the last block is used either for voice or data transmissions.</p>\n<p><a href=\"/img/notam-images/may2022/VDL3-Slots.png\"><img src=\"/img/notam-images/may2022/VDL3-Slots.png\" alt=\"VDL3 message slots\"></a></p>\n<p>We assume that all air and ground stations require one data-slot for the communication, in order to avoid the complex handshaking protocol as is required in the real world.\nThis handshaking cannot be simulated due to missing knowledge about required data slots of remote-stations.\nBased on all aircraft and ground stations in the vicinity of the A32NX, it is possible to calculate the number of required slots until\nevery station has had the chance to send one chunk. The time between all available chunks defines the delay required for a chunk size of 496 bits, from which the datarate is\nthen derived.</p>\n<p>Due to the half-duplex nature of VHF communication transmissions, the system manages the chunks for ground-to-air and air-to-ground communication in separate blocks.\nThis allows a realistic simulation for simultaneous transmissions from two different stations.\nMultiple messages in the same direction are handled in a first come, first served manner.</p>\n<p>This chunk estimation is updated every thirty seconds, allowing a realistic simulation based on the aircraft around the A32NX and reachable ground stations. Due to SATCOM and HF communications not being fully simulated, we are limited to running a minimal data rate and it is currently not possible to lose datalink communication.</p>\n<h2>Future development</h2>\n<p>Later versions will simulate realistic SATCOM and HF datalink communications, with the ATSU automatically selecting the type of communications to be used.</p>\n<p>We are also looking to improve line-of-sight estimation as soon as we can access terrain data. At the moment, the system ignores terrain effects due to a lack of data. Having access to this data will allow us to calculate whether either terrain or buildings are interfering with the communication between the A32NX and any ground stations.</p>\n<hr>\n<h2>General Information</h2>\n<p>Stay up to date with information from FlyByWire Simulations by following our social media!</p>\n<ul>\n<li><a href=\"https://twitter.com/FlyByWireSim\">Twitter</a></li>\n<li><a href=\"https://www.facebook.com/FlyByWireSimulations/\">Facebook</a></li>\n</ul>\n<p>If you require support or would like to submit a bug report please see the links below:</p>\n<ul>\n<li><a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/\">Support Guide</a></li>\n<li><a href=\"https://discord.gg/flybywire\">Discord Support</a></li>\n<li><a href=\"https://github.com/flybywiresim/a32nx/issues/new/choose\">GitHub Issues</a></li>\n</ul>\n<p>When submitting an issue or asking for support to do the following:</p>\n<ul>\n<li>Visit our <a href=\"https://docs.flybywiresim.com/fbw-a32nx/support/reported-issues/\">Reported Issues Documentation</a> for common problems and workarounds.</li>\n<li>Ensure that your issue has not already been reported on our GitHub.</li>\n</ul>\n<p>Download the latest version of the A32NX:</p>\n<ul>\n<li><a href=\"https://api.flybywiresim.com/installer\">Installer</a></li>\n<li><a href=\"https://flybywiresim.com/a32nx/#download\">Standalone Versions</a></li>\n</ul>\n<hr>\n<p>Safe skies and happy flying!</p>\n<p><em>Editor: Valastiri, DirtyFormal</em></p>\n","readingStats":{"text":"5 min read","minutes":4.585,"time":275100,"words":917},"title":"ATSU VDL3 Simulation","date":"2022-06-24","authors":["Sven [de en]"],"category":"UPDATE","metaImage":"/img/notam-images/may2022/vld3header.png","metaAlt":"FlyByWire Simulations"},"embedPreviewPath":"img/notams-embed-previews/e223d222-ca9f-4a6b-9b83-090c80003a31.png"},"__N_SSG":true}